.cf.xml/Catalogs/общ_Обработчики.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>общ_Обработчики</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВерсияИнтерфейса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Синоним</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеОбработчика</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьКФайлуДляОтладки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

.cf.xml/Catalogs/общ_Обработчики/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Не ЗначениеЗаполнено(Объект.Наименование) Тогда
		ЗагрузитьИзФайла();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытийФормы

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗагрузитьИзФайла(Команда = Неопределено)

	фильтр = СтрШаблон("Внешние обработки (*.%1)|*.%1", "epf");
	параметрыДиалога = Новый ПараметрыДиалогаПомещенияФайлов("Выберите обработчик", Ложь, фильтр);
	
	оповещение = Новый ОписаниеОповещения("ПослеЗакрытияДиалогаВыбораФайла", ЭтаФорма);
	НачатьПомещениеФайлаНаСервер(оповещение,,,, параметрыДиалога, УникальныйИдентификатор);

КонецПроцедуры

#КонецОбласти // ОбработчикиКомандФормы

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПослеЗакрытияДиалогаВыбораФайла(ОписаниеФайла, ДопПараметры) Экспорт
	
	Если ОписаниеФайла = Неопределено Или ОписаниеФайла.ПомещениеФайлаОтменено Тогда
		Возврат;
	КонецЕсли;
	
	ФайлНаСервереВХранилищеОбработчика(ОписаниеФайла.Адрес);
	
КонецПроцедуры

&НаСервере
Процедура ФайлНаСервереВХранилищеОбработчика(пАдресХранилища)

	Если Не ЭтоАдресВременногоХранилища(пАдресХранилища) Тогда 
		Возврат;
		
	КонецЕсли;
	
	справочникОбъект = РеквизитФормыВЗначение("Объект");
	
	двоичныеДанныеФайла = ПолучитьИзВременногоХранилища(пАдресХранилища);
	путьКФайлу = ПолучитьИмяВременногоФайла("epf");
	двоичныеДанныеФайла.Записать(путьКФайлу);

	текущийБезопасныйРежим = БезопасныйРежим();
	Если текущийБезопасныйРежим <> Ложь Тогда
		УстановитьОтключениеБезопасногоРежима(Истина);
				
	КонецЕсли;
			
	безЗащиты = Новый ОписаниеЗащитыОтОпасныхДействий;
	безЗащиты.ПредупреждатьОбОпасныхДействиях = Ложь;
		
	внешняяОбработка = ВнешниеОбработки.Создать(путьКФайлу, Ложь, безЗащиты);
	
	справочникОбъект.ВерсияИнтерфейса = внешняяОбработка.ВерсияИнтерфейса();
	справочникОбъект.Комментарий = внешняяОбработка.Метаданные().Комментарий;
	справочникОбъект.Наименование = внешняяОбработка.Метаданные().Имя;
	
	справочникОбъект.Синоним = внешняяОбработка.Метаданные().Синоним;
	справочникОбъект.ХранилищеОбработчика = Новый ХранилищеЗначения(двоичныеДанныеФайла);
	
	справочникОбъект.Записать();
	
	ЗначениеВРеквизитФормы(справочникОбъект, "Объект");

КонецПроцедуры

#КонецОбласти // СлужебныеПроцедурыИФункции
